# Cable Size Number Of Neutral Conductors Property

Source: https://www.revitapidocs.com/2026/4fbf011b-96d8-bab1-e0aa-b4437064e5e4.htm

---

| Cable Size Number Of Neutral Conductors Property |
| --- |

The number of Neutral Conductors.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int NumberOfNeutralConductors { get; set; }
```

```
Public Property NumberOfNeutralConductors As Integer
	Get
	Set
```

```
public:
property int NumberOfNeutralConductors {
	int get ();
	void set (int value);
}
```

```
member NumberOfNeutralConductors : int with get, set
```

#### Property Value

Int32 Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for numberOfNeutralConductors is negative. |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace